[
    {
        "id": "gerer-budget-etudiant",
        "titre": "Comment gérer son budget étudiant efficacement",
        "description": "Apprenez à mieux gérer vos dépenses en tant qu'étudiant grâce à des conseils simples et des outils accessibles à tous.",
        "contenu": "<h1>Comment gérer son budget étudiant efficacement</h1><p>Entre le loyer, les courses, les transports et les sorties, le budget étudiant peut rapidement devenir un casse-tête. Pourtant, quelques réflexes simples peuvent faire toute la différence.</p><ul><li>Établir un budget mensuel réaliste</li><li>Utiliser des applications de gestion financière</li><li>Profiter des aides et réductions étudiantes</li></ul><p>Avec un peu de rigueur, il est possible de vivre correctement sans stress financier.</p>",
        "reaction": {
            "likes": 19,
            "dislikes": 0
        },
        "date": 1744455312862,
        "image": "http://localhost:5173/images/idee.jpg"
    },
    {
        "id": "epargner-jeune-astuces",
        "titre": "Épargner quand on est jeune: mission possible !",
        "description": "Même avec de petits revenus, il est possible de commencer à épargner tôt. Voici comment s’y prendre pas à pas.",
        "contenu": "<h1>Épargner quand on est jeune : mission possible !</h1><p>Épargner dès le début de sa vie active permet de construire sereinement son avenir. Même 10€ par mois font une différence à long terme.</p><p>Commencez par définir un objectif : voyage, permis, projet pro… Ensuite, automatisez vos virements vers un livret ou une solution adaptée aux jeunes. Plus tôt vous commencez, plus les intérêts composés travaillent pour vous !</p>",
        "reaction": {
            "likes": 16,
            "dislikes": 0
        },
        "date": 1744459784620
    },
    {
        "id": "vie-etudiante",
        "titre": "La Vie Étudiante à Toulon",
        "description": "Une ville dynamique entre mer et collines, idéale pour étudier et s'épanouir",
        "contenu": "<style>\n        .article {\n            font-family: Arial, sans-serif;\n            line-height: 1.6;\n            background-color: #f9f9f9;\n            color: #333;\n            padding: 20px;\n\t\t\tborder-radius: 4px;\n        }\n        .article header {\n            text-align: center;\n            padding: 30px 0;\n        }\n        .article img {\n            max-width: 100%;\n            height: auto;\n            border-radius: 8px;\n        }\n        .article .content {\n            max-width: 800px;\n            margin: auto;\n        }\n        .article h1, .article h2 {\n            color: #2a6d9e;\n        }\n        .article .illustration {\n            margin: 20px 0;\n        }\n        .article footer {\n            text-align: center;\n            margin-top: 40px;\n            font-size: 0.9em;\n            color: #777;\n        }\n    </style>\n<header>\n        <h1>La Vie Étudiante à Toulon</h1>\n        <p>Une ville dynamique entre mer et collines, idéale pour étudier et s'épanouir</p>\n    </header>\n\n    <div class=\"content\">\n        <h2>Un cadre de vie unique</h2>\n        <p>\n            Située sur les rives de la Méditerranée, Toulon offre un cadre idyllique pour les étudiants. Avec son port animé, ses plages accessibles en quelques minutes, et les montagnes du Faron en arrière-plan, la ville allie nature, culture et vie urbaine.\n        </p>\n\n        <h2>Des établissements de qualité : focus sur ISEN Méditerranée</h2>\n        <p>\n            Toulon accueille plusieurs établissements d'enseignement supérieur, dont <strong>ISEN Méditerranée</strong>, une école d’ingénieurs de renom spécialisée dans les technologies numériques et les innovations durables.\n            Située au cœur du quartier de la créativité Chalucet, l'école offre un environnement moderne et collaboratif, idéal pour apprendre, expérimenter et innover.\n        </p>\n\n        <h2>Vie associative et culturelle</h2>\n        <p>\n            La vie étudiante toulonnaise est rythmée par de nombreuses associations, événements, concerts et festivals. Les étudiants peuvent s'engager dans des projets humanitaires, culturels ou entrepreneuriaux.\n            Le réseau associatif d'ISEN Méditerranée est particulièrement actif, avec des clubs allant de la robotique à la voile, en passant par la musique ou les jeux vidéo.\n        </p>\n\n        <h2>Se déplacer et se loger</h2>\n        <p>\n            Le réseau de transports en commun (bus, navettes maritimes) permet de se déplacer facilement dans l'agglomération. Pour le logement, la ville propose des résidences étudiantes, des colocations ou encore des appartements accessibles à la location.\n        </p>\n\n        <h2>Conclusion</h2>\n        <p>\n            Étudier à Toulon, c’est bénéficier d’une formation de qualité dans un environnement exceptionnel. ISEN Méditerranée incarne cette excellence académique alliée à une vie étudiante riche et épanouissante.\n        </p>\n    </div>\n\n    <footer>\n        &copy; 2025 - Vie Étudiante à Toulon. Tous droits réservés.\n    </footer>",
        "reaction": {
            "likes": 0,
            "dislikes": 0
        },
        "date": 1747677171450,
        "image": "https://partir.ouest-france.fr/magazine/wp-content/uploads/2022/10/lsntnybyltk.jpg"
    },
    {
        "id": "cage",
        "titre": "L'ingénieur qui fait du café",
        "description": "Entre théorie et pratique, on apprend bien plus qu’à résoudre des équations en école d’ingénieur : on découvre comment bidouiller des solutions qui marchent – parfois même du premier coup ! Dans cet article, retour sur ces projets, astuces ou coups de génie d’étudiants qui, contre toute attente… font le café. Littéralement ou pas, à vous de juger.",
        "contenu": "<h1>L'ingénieur qui fait du café</h1>\n<p>Entre théorie et pratique, on apprend bien plus qu’à résoudre des équations en école d'ingénieur : on découvre comment bidouiller des solutions qui marchent – parfois même du premier coup ! Dans cet article, retour sur ces projets, astuces ou coups de génie d'étudiants qui, contre toute attente… font le café. Littéralement ou pas, à vous de juger.</p>\n<img src=\"cafe.jpg\" alt=\"Un ingénieur faisant du café\" />",
        "reaction": {
            "likes": 0,
            "dislikes": 0
        },
        "date": 1747762304433
    },
    {
        "id": "nutrition-etudiant",
        "titre": "La Nutrition Maligne pour les Étudiants Pressés",
        "description": "Entre les cours, les partiels et un budget souvent serré, bien manger à la fac peut sembler mission impossible. Cet article propose des conseils nutritionnels simples et accessibles pour les étudiants, avec des bons plans pour faire ses courses à petit prix, des astuces pour optimiser son temps en cuisine, et 5 recettes faciles, rapides et équilibrées à préparer en moins de 20 minutes. Parce que manger sain, c’est aussi booster sa concentration, son énergie… et son moral !",
        "contenu": "<h1>La Nutrition Maligne pour les Étudiants Pressés</h1>\n\n<p>Entre les cours, les partiels et un budget souvent serré, bien manger à la fac peut sembler mission impossible. Pourtant, adopter une alimentation équilibrée est essentiel pour booster sa concentration, son énergie et son moral. Cet article vous propose des conseils nutritionnels simples et accessibles, des bons plans pour faire ses courses à petit prix, des astuces pour optimiser son temps en cuisine, et 5 recettes faciles, rapides et équilibrées à préparer en moins de 20 minutes.</p>\n\n<h2>Conseils Nutritionnels pour Étudiants</h2>\n\n<p>Manger sainement ne signifie pas nécessairement passer des heures en cuisine. Voici quelques conseils pour vous aider à adopter une alimentation équilibrée sans trop de contraintes :</p>\n\n<ul>\n    <li><strong>Petit-déjeuner équilibré</strong> : Commencez votre journée avec un petit-déjeuner riche en fibres et en protéines, comme des flocons d'avoine avec des fruits et du yaourt.</li>\n    <li><strong>Snacks sains</strong> : Préférez les fruits, les noix et les légumes crus aux snacks industriels.</li>\n    <li><strong>Hydratation</strong> : Buvez suffisamment d'eau tout au long de la journée.</li>\n    <li><strong>Repas équilibrés</strong> : Assurez-vous que chaque repas contient des protéines, des glucides complexes et des légumes.</li>\n</ul>\n\n<h2>Bons Plans pour Faire ses Courses à Petit Prix</h2>\n\n<p>Faire ses courses sans exploser son budget est possible avec quelques astuces :</p>\n\n<ul>\n    <li><strong>Liste de courses</strong> : Faites une liste avant de partir et tenez-vous-y pour éviter les achats impulsifs.</li>\n    <li><strong>Promotions et soldes</strong> : Profitez des promotions et des soldes pour acheter en plus grande quantité.</li>\n    <li><strong>Marchés locaux</strong> : Les marchés locaux offrent souvent des produits frais à des prix intéressants.</li>\n    <li><strong>Produits de saison</strong> : Les fruits et légumes de saison sont généralement moins chers et plus savoureux.</li>\n</ul>\n\n<h2>Astuces pour Optimiser son Temps en Cuisine</h2>\n\n<p>Voici quelques astuces pour gagner du temps en cuisine :</p>\n\n<ul>\n    <li><strong>Préparation à l'avance</strong> : Préparez vos repas pour la semaine le week-end ou le soir précédent.</li>\n    <li><strong>Utilisez des ustensiles pratiques</strong> : Des appareils comme le multicuiseur ou le mixeur peuvent vous faire gagner du temps.</li>\n    <li><strong>Simplifiez les recettes</strong> : Optez pour des recettes simples avec peu d'ingrédients.</li>\n    <li><strong>Utilisez des restes</strong> : Transformez les restes de repas en nouveaux plats pour éviter le gaspillage.</li>\n</ul>\n\n<h2>5 Recettes Faciles, Rapides et Équilibrées</h2>\n\n<p>Voici 5 recettes que vous pouvez préparer en moins de 20 minutes :</p>\n\n<h3>Salade de Quinoa</h3>\n<p>Ingrédients : Quinoa, légumes variés, huile d'olive, vinaigre balsamique, sel, poivre.</p>\n<p>Préparation : Cuire le quinoa selon les instructions du paquet. Mélanger avec des légumes coupés en dés, assaisonner avec de l'huile d'olive, du vinaigre balsamique, du sel et du poivre.</p>\n\n<h3>Omelette aux Légumes</h3>\n<p>Ingrédients : Œufs, légumes variés, huile d'olive, sel, poivre.</p>\n<p>Préparation : Faire revenir les légumes dans une poêle avec un peu d'huile d'olive. Ajouter les œufs battus, saler et poivrer. Cuire jusqu'à ce que l'omelette soit prise.</p>\n\n<h3>Bowl de Riz et Légumes</h3>\n<p>Ingrédients : Riz, légumes variés, sauce soja, huile de sésame, graines de sésame.</p>\n<p>Préparation : Cuire le riz selon les instructions du paquet. Mélanger avec des légumes saut",
        "reaction": {
            "likes": 0,
            "dislikes": 0
        },
        "date": 1747772739313
    }
]